# ProhibitUniqueElementDeletion Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..UniqueElementFailures..::..ProhibitUniqueElementDeletion Property
BuiltInFailures..::..UniqueElementFailures Class See Also
---
Internal setting '%1!s!' is required by Revit and has been deleted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ProhibitUniqueElementDeletion { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ProhibitUniqueElementDeletion As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ProhibitUniqueElementDeletion {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..UniqueElementFailures Class
Autodesk.Revit.DB Namespace